Revit 2024 API
ImportIFCOptions.GetImportIFCOptions Method
 Returns the current Revit instance's ImportIFCOptions.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ImportIFCOptions GetImportIFCOptions()
Visual Basic
Public Shared Function GetImportIFCOptions As ImportIFCOptions
Visual C++
public:
static ImportIFCOptions^ GetImportIFCOptions()
Return Value
 The ImportIFCOptions for the current Revit instance.
See Also
ImportIFCOptions Class
Autodesk.Revit.DB Namespace